// Экстра таск 2
// Создайте объект obj, с ключами firstNum и secondNum.

// Напишите код который проверяет firstNum и secondNum:

// в случае если firstNum и secondNum не равны нулю, перемножьте числа и выведите в консоль результат
// если же одно из чисел равно нулю, то выведите в консоль их сумму
// если же оба значения равные нулю, выведите в консоль булево: false
// если же значением secondNum является булево false, вывести сумму

// Экстра таск 1
// Создайте переменную data, в которой хранится один из 8 типов данных.
// Напишите код, который выводит в консоль строку:
// It's number
// если в переменной data хранится число, или:
// It's boolean
// если в переменной булевый тип данных.
// Если же в data лежит какое-то другое значение, то выводите:
// It's not number and boolean

// Задание 23
// В переменной minute лежит число от 1 до 60. Определите в какую четверть часа попадает это
// число (в первую, вторую, третью или четвертую).Так же если число не находится в диапазоне от
//  1 до 60, то выведите
// "Число не верное"
// Например:
// minute = 10  -> 1minute = 25  -> 2
// minute = 30  -> 3

// Задание 20
// Создайте переменную string со строкойесли регистр маленький переведите строку в верхний
// регистра если большой переведите в нижнийИспользуйте switch case
// Не перезаписывавйте переменную string

// Задание 19
// Создайте переменную name и age. проверайте что переменная name содержит строковое значение
// и age - числовое значениеесли все верно - выведите сообщение
// "Все введено верно"
// если какой-то тип данных не совпадает - выведите
// "Данные введены не верно"

// Задание 18
// Создайте обьект user с ключами name и age если возраст меньше 17,то выведите в консоль сообщение
// "Привет, меня зовут {имя} и я не совершеннолетний"
// если нет то выведите в консоль
// "Привет, меня зовут {имя} и это мой первый код"

// Задание 14
// Создайте переменную num и присвойте ей числовое значение если число положительное или равно 0,
// выведите в консоль сообщение "Положительное" если число отрицательное, выведите в консоль сообщение
//  "Отрицательное"

// Задание 13
// Создайте переменные firstNum, secondNum, age и присвойте им числовые значения.
// Если сумма firstNum и secondNum больше числа хранящегося в переменной age, то выведите в консоль:
// Сумма чисел ${sum} больше моего возраста ${age}
// К примеру: если в firstNum хранится 25, в secondNum - 10, а в age число 22, то получаем вывод в консоли:
// Сумма чисел 35 больше моего возраста 22
// Если же в firstNum хранится 25, в secondNum - 10, а в age число 37, то получаем вывод в консоли:
// Сумма чисел 35 меньше моего возраста 37
// Задание 12
// Создайте переменные firstNum, secondNum, thirdNum и присвойте им числовые значения.
// Выведите в консоль число с наибольшим значением.
// Например: если в firstNum будет хранится число 5, в secondNum 3, а в thirdNum 16, то
//  вывод в консоль должен быть:
// Максимальное число 16
// Учтите возможность равенства всех трех чисел.

// Задание 11
// Создайте переменные userName и password.
// Проверьте хранится ли в переменной userName значение "ivan", а в переменной password значение 333.
// Если значения верные, вывести в консоль:
// Добро пожаловать
// в противном случае:
// Пользователь не найден

// Задание 10
// Создайте переменные firstNum и secondNum, присвойте переменным числа.
// если сумма больше 10 и в то же время меньше 20 то, умножьте сумму на 5.если же сумма больше
//  20 и меньше 50, то разделите сумму на 3.в любых других случаях прибавьте к сумме 10.Вывести
//  результат в консоль.
// Пример, если в firstNum хранится значение 10, а в secondNum значение 5 то ваш код должен в начале
//  найти сумму - 15, так как 10 + 5 = 15
// Здесь, сумма больше десяти и меньше двадцати, ее нужно умножить на пять: 15 * 5, получаем результат:
// 75
// Задание 11
// Переменным price(цена) и discount(скидка) присвойте числовые значения. Высчитайте
// итоговую цену с учетом скидки и выведите результат в консоль.
// Используйте console.log в коде - единожды, только для вывода цены со скидкой.
// К примеру вы получили цену 600 и скидку 15. Вывод в консоль должен быть:
//  510

// Задание 4
// Сделайте задание 3 используя условный (тернарный) оператор.
// Проверьте является ли содержимое number равным 23, и выводит в консоль:
// Верно
// если же number не равен 23 выведите в консоль:
// Неверно

// Задание 1
// Создайте переменную firstNumber и secondNumber, задайте им числовые значения и при
// помощи тернарного оператора сравните числа в переменных, если firstNumber больше, чем secondNumber,
// то выведите в консоль фразу:firstNumber больше, чем secondNumber
// иначе выведите фразу:firstNumber не больше, чем secondNumber
// Например:
// let firstNumber = 5let secondNumber = 10
// Вывод:
// '5 больше, чем 10'

// Задание 6
// Создайте переменную num и присвойте ей число. Нужно посчитать количество цифр в числе
// num и определить, введенное число:
// однозначноедвузначноеТакже, нужно определить, что число:положительное или отрицательное.
// Результат вывести в консоль в виде строки.
// Например, мы получили число 9, так как наше число состоит из одной цифры и больше нуля,
// то мы должны возвратить строку:
// Число 9 однозначное положительное
// Если же мы получим число -23, то ответ соответственно должен быть:
// Число -23 двузначное отрицательное

// Задание 7
// Создайте переменную favDrink, присвойте ей значение в виде строки.
// • Если favDrink равно beer или vodka, нужно вывести в консоль:
// Чрезмерное употребление алкоголя вредит вашему здоровью
// • Если favDrink равно coffee, нужно вывести в консоль:
// Кофеин вреден для сердца
// • Если favDrink равно milk, нужно вывести в консоль:
// Поздравляю! Молоко очень полезное
// • Если favDrink что-то другое, нужно вывести в консоль:
// К сожалению такого напитка нет в списке
// Указания: Задание необходимо выполнить с помощью конструкции switch. Вывести всё в консоль.

// Задание 8
// Создайте переменную stroka, присвойте ей строку или число, например:
// "987456"
// или:
// 987456
// Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.
// Если это так, выведите в консоль:
// да
// в противном случае выведите:
// нет
// Пример: допустим в переменной stroka хранится строка "123456". Ваш код должен сложить
//  первые три числа 1 + 2 + 3, затем последние три 4 + 5 + 6
// затем, сравнить сумму, 6 === 15
// Так как сумма чисел не равна, данное выражение возвращает false.
// Получаем вывод в консоль:
// нет

// 2 тапшырма : Бир user деген обьект ачасынар. Ичинде sum деген ключ, 81 деген маанисин бересинер.
//  User-дин аты бар, почтасы бар, жашы бар жана user-дин паролю бар. If else конструкциясы ,
//   prompt функциясы менен user-дин почтасын сурайсынар. Эгерде почтасы силер жазган почтага
//   туура келбесе, анда “кечиресиз, мындай почта жок” деген alert чыгарыш керек. Эгерде почтасы
//   дал келсе, дагы prompt менен пароль сурайсынар. Пароль силер жазган парольго туура келбесе ,
//  alert менен “пароль туура эмес” деп чыгарасынар. Эгерде туура болсо, prompt менен “9 * 9 = ? ,
//  туура эсептесен премия аласын” деп user ге чыгарасынар. Эгер user жазган сан sum деген ключко
//  барабар эмес болсо, alert ке “туура эмес жоок бердин”. Барабар болсо, alert ке “Туура! Серин
//   премиян = ‘${user.sum}’” деп чыгарасынар.

//  Ошондо алертке “ Туура! Сенин премиян = 81 ” деп чыгып калыш керек

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной
//  c. Затем выведите в консоль остаток деления на 4 переменной c.
// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.
//  Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите
//  в переменную result. Выведите в консоль значение переменной result.
// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и
// выведите её в консоль.
// 10. Вам даны переменные name='Аскар', number=10. Сложите данные переменные, присвойте результат
// переменной result и выведите её в консоль.

//?Строки:
// 1. Вам дана переменная str, присвойте ей значение 'Привет, Мир!'. Выведите значение
// этой переменной в консоль.
// 2. Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и
// операции сложения строк выведите в консоль фразу 'Привет, Мир!'.
// 3. Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'.
// 4. Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.
// 5. Вам даны четыре переменные.
// Первая - для хранения

// количества дней. Присвойте ей значение "365".
// Вторая - для хранения названия нашей планеты "Земля".
// Третья - для хранения примерного количества жителей нашей планеты. Присвойте ей значение "7 млрд.".
// Четвертая - для хранения слова "Солнце".
// Далее, используя текст и переменные, нужно вывести в консоль такой абзац:
// "В нашем году 365 дней. Днём у нас светит Солнце. Население планеты Земля составляет
// примерно 7 млрд. человек."

// Typeof:
// 1. Вам дана переменная a=50. Выведите в консоль тип значения этой переменной.
// 2. Вам даны переменные a=10, b=35. Создайте переменную result, и сделайте так,
//  чтобы в консоли значение переменной result было string.
// 3. Вам дана переменная a=10, выведите в консоль тип этой переменной - string.

//1:Пользователь вводит название месяца исходя из введенного названия месяца нужно
// вывести сообщение с названием времени года.
//Например:
//Пользователь: январь
//Компьютер: это зима
// 1.Нужно написать условие для действий пешехода при различных сигналах светофора.
// Если сигнал красный, то надо стоять, иначе, если желтый - надо приготовиться, а иначе - можно идти.
// 2.С помощью метода prompt() получите сначала имя пользователя, затем год его рождения и
// сохраните в 2 переменные.
//  Вычислите возраст пользователя, и выведите его в condole.log в таком формате "Антон: 24".
// 3.Компания по транспортировке мебели заносит любую мебель на 1-й этаж бесплатно, со 2-го по
//  4-й включительно - по 20som., с 5-го по 7-й включительно - по 30som., а с 8-го и выше - по 40som.
//  Узнайте у пользователя, на какой этаж нужно занести мебель и
// рассчитайте стоимость транспортировки.
//4.Написать программу на JS, которая рекомендует фильм в зависимости от
// возраста пользователя.
// • Программа сначала должна спросить у пользователя его возраст.
// • Если возраст от 1 до 13: посоветуйте ваш любимый мультфильм
// • Если возраст от 14 до 17: посоветуйте приключенческий фильм.
// • Если возраст от 18 и выше: посоветуйте серьезный фильм.
// • Если пользователь ввел неверный возраст, сообщите ему об ошибке.
//5. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
// 6. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет
// выводиться 'a больше b', 'a меньше b'.

// let color = "Желтый"
// вывести в консоль индекс буквы "ы"

// let greet = "hello"
// вывести в консоль последнюю букву

// let name = "jaCKsON"
// вывести в консоль только первую букву в верхнем регистре

// let name = "Denzel Washington"
// проверьте содержит ли name порядок букв "Wash"
// includes

// let name = "John"
// вывести в консоль переменную name в верхнем регистре

// №2
// let surname = "WICK"
// вывести в консоль переменную surname в нижнем регистре

// №3
// let a =  "WaterMelon"
// вырежьте кусок "Melon". c методом slice

// №4
// let str = "world"
// вырежьте только первую букву с методом slice (только с одним параметром)

// №5
// let str = "Hello world"
// вывести в консоль индекс первого "o" и последнего "o"
// indexOf и lastIndexOf

// №6
// let sentence = "Today was a great day!"
// проверьте содержит ли предложение слово "day"
// метод includes()

// №7
// у вас есть два числа a, b в котором одном string в другом number. Вы должны найти сумму
// let a = "5"
// let b = 10

// №8
// let a = "hello "
// let b =  "world"
// попробуйте сложить двух переменных

// №9
// let str =  "  Georgia "
// вывести в консоль длину строки

// №10
// let a = "Hello"
// let b = "world"
// найдите сумму длин двух строк
// должно получиться "Hello world"

// №11
// let a = 10
// let b = 5
// выполните все математические операции в четырех консолях
// // -, +, *, /

// №12
// let num = 15
// преобразуйте в строку (string)

// №13
// let str = "15"
// преобразуйте в число (number)

// №14
// let message = "hello"
// let age = 20
// let isAlive = true
// let obj = {}
// let empty = null
// let und = undefined
// вывести в консолях типы данные переменных через оператор typeof

// №15
// let num = 15145
// преобразуйте num в строку и выведите длину строки

// №16
// let str = "15"
// преобразуйте str в число и умножьте её на 5

// №17
// let name = "Denzel Washington"
// проверьте содержит ли name порядок букв "Wash"

// №18
// let name = "jaCKsON"
// вывести в консоль только первую букву в верхнем регистре

// №19
// let greet = "hello"
// вывести в консоль последнюю букву

// №20
// let color = "Желтый"
//  вывести в консоль индекс буквы "ы"

// №21
// у вас есть два числа a, b в виде строк должны найти сумму
// let a = "1"
// let b = "3"

// создайте логику, которая возвращает день недели в соответствии с введенным числом:

// 1 возвращается "Monday"
// 2 возвращается "Tuesday"
// 3 возвращается "Wednesday"
// 4 возвращается "Thursday"
// 5 возвращается "Friday"
// 6 возвращается "Saturday"
// 7 возвращается "Sunday"
// В противном случае возвращается "Wrong, please enter a number between 1 and 7"

// let name = "ringo"
// если первая буква name равно "R" то выведите в консоль "name играет в Банжо",
// иначе "name не играет в Банжо"

// let greet = "Hello"
// проверьте написан ли greet верхним регистром, если да выведите в консоль "Yes!", иначе "No!"

// let age = 20
// проверьте если тип данный age равен ли к "number",  если да "true its number", иначе "no, its not"

// let num = -20
// проверьте отрицательный ли число, если отрицательное то выведите в консоль "Yes", иначе "No"

// let num = 5
// проверьте число на чётность если цифра четное то выведите "Even", в противном случае "Odd"

// создайте логику которая проверит заглавные ли все буквы
// "a" --> false
// "A" --> true
// "HELLo" --> false

// №2
// создайте логику которая возвратит аббревиатуру фамилии и имени
//  должна возвращать первые буквы
// let name = "Denzel"
// let surname = "Washington"
// вывести в консоль "D. W."
// интерполяция

// №3
// let name = "John"
// let age = 35
// вывести в консоль `Happy Birthday {name}! You are {age} today.`
//интерполяция

// №4
// let animal = "Eagle"
// проверьте является ли последняя буква равна к "e"
// если да выведите в консоль "true", в противном случае "false"

// №5
// создайте логику светофора
// и подсказывает следующие цвета, если в переменному дать
// "Красный" должно возвращать "Желтый" т.к. после красного
// загорится желтый цвет
// ("Желтый") --> "Зеленый"
// ("Зеленый") --> "Красный"

// №6
// let num = 20
// проверьте делится ли num на 10 без остатка,
// если да выведите в консоль "Yes", иначе "No"

// №7
// let language = "JavaScript"
// если language равна к "JavaScript" то выведите в консоль
// "Frontend", если равна к "Python" то вывести "Backend", иначе "error"

// №8
// let a = 10
// let b = 4
// если сумма двух переменных больше 20
// вывести в консоль "true", иначе "false"

// №9
// let n = 10
// проверьте на четность если да "Чётный", иначе "Нечётный"
//! тернарный оператор

// №10
// let country = "Kyrgyzstan"
// если длина переменного больше или равно 10,
// то выведите в консоль true, в противном случае false

// №11
// let car = "Mercedes"
// проверьте индекс последнего "e", чётный или нечётный?

// №12
// let str = "123"
// найдите сумму каждой цифры
// 1 + 2 + 3

// №13
// let name = "Alymbek"
// проверьте есть ли в имени "bek", если есть вывести
// "true", иначе "false"

// №14
// let a = 1
// если тип данный переменного равна к "number", то выведите в консоль
// "у переменного нету длины и индекса", если равна к "string", то вывести
//  "у переменного есть длина и индексы", если равна к "boolean" то вывести
//  "true || false", если другой тип данный вывести "404"

// №15
// let a = 15
// let b = 3
// let operation = "+"
// если operation равна к "+", то выведите в консоль сумму a и b,
// если равна к "*", то выведите произведение,
// если равна к "-", то выведите вычитание,
// если равна к "/", то вывести деление,
// если другое вывести "Напишите математическую операцию!"

// Задание 1
// Создайте переменную firstNumber и secondNumber, задайте им числовые значения
// и при помощи тернарного оператора сравните числа в переменных, если firstNumber больше, чем secondNumber,

// то выведите в консоль фразу:
// firstNumber больше, чем secondNumber

// иначе выведите фразу:
// firstNumber не больше, чем secondNumber

// Например:

// let firstNumber = 5
// let secondNumber = 10
// Вывод:

// '5 больше, чем 10'

// Задание 2
// Создайте переменную number с числовым значением.

// Используя конструкцию if..else, напишите код, который проверяет переменную number на
// чётность, если число в number чётное, то выведите в консоль:

// Число number четное
// где вместо number должно быть само число.

// Если нечетное:

// Число number нечетное
// здесь, также вместо number должно быть само число.

// Задание 3
// Создайте переменную number с числовым значением.

// Напишите код, который проверяет является ли содержимое number равным 23, и выводит в консоль:

// Верно
// если же number не равен 23 выведите в консоль:

// Неверно

// Задание 4
// Сделайте задание 3 используя условный (тернарный) оператор.

// Проверьте является ли содержимое number равным 23, и выводит в консоль:

// Верно
// если же number не равен 23 выведите в консоль:

// Неверно

// Задание 5
// Создайте переменную number с числовым значением. Если number больше нуля и меньше
//  5-ти выведите в консоль:

// Верно
// иначе выведите:

// Неверно

// Задание 6
// Создайте переменную num и присвойте ей число. Нужно посчитать количество цифр в
// числе num и определить, введенное число:

// однозначное
// двузначное
// Также, нужно определить, что число:
// положительное или отрицательное.

// Результат вывести в консоль в виде строки.

// Например, мы получили число 9, так как наше число состоит из одной цифры и больше нуля,
//  то мы должны возвратить строку:

// Число 9 однозначное положительное
// Если же мы получим число -23, то ответ соответственно должен быть:

// Число -23 двузначное отрицательное

// Условные и логические операторы. Классная работа

// Задание №1
// Напишите оператор if, такой,
// чтобы в качестве выражения в скобках
// у него были значения true, false.
// Например, if( true ) или if( false ).
//  Посмотрите как работает этот оператор,
// поместив какую-нибудь команду после
// круглых скобок
// Например, console.log(1);

// Напишите оператор if так, чтобы у него выражение в скобках
// был true или false. Например:
//     if( true ) или
//     if( false )
// Посмотрите как работает данный оператор, поместив
// какую-нибудь команду после фигурных скобок. Например:
//     console.log(1);

// Задание №2
// Написать программу на JS, которая рекомендует фильм в зависимости от
// возраста пользователя.
//  • Программа сначала должна спросить у пользователя его возраст.
//  • Если возраст от 1 до 13: посоветуйте ваш любимый мультфильм.
//  • Если возраст от 14 до 17: посоветуйте приключенческий фильм.
//  • Если возраст от 18 и выше: посоветуйте серьезный фильм.
//  • Если пользователь ввел неверный возраст, сообщите ему об ошибке.
// Пример ввода:
//  • Сколько вам лет?
//  • 18
//  • Посмотрите фильм "Пролетая над гнездом кукушки"
// Указания:
//  • Вы можете придумать больше градаций возрастов и фильмов
//  • Задание необходимо выполнить с помощью if ... else if ... else

// Задание №3
// Сделать последовательное упрощение к булевым величинам.
//  • (2 < 3) && (3 > 4) || true
//  • !true &&  (!true || 100 != 5*5)
//  • ("123" == 123) || ((10 <= 10) && (' ' === false))
// Пример выполнения задания:
//  • true && (false || (2 < 3 ))
// Упрощение:
//  • true && (false || (2 < 3))
//  • true && (false || true)
//  • true && true
//  • true
// Ответ: true
// Указания: Вы можете проверить себя, выполнив эти примеры в консоли и получив результат.

// Задание №4
// Дана строка из 3-х цифр.
// Найдите сумму этих цифр.
// То есть сложите как числа первый символ строки, второй и третий.
// Например:
// let str = '123'
// Найти сумму '1' + '2' + '3' = ?

// Задание №5
// Переменная num может принимать 4 значения: 1, 2, 3 или 4.
// Если она имеет значение '1', то в переменную result запишем 'зима',
// если имеет значение '2' – 'весна', '3' - 'лето', 4 - 'осень'. А затем выведите что
//  ввел пользователь и что записалось в переменную в result.
// Сделайте этот таск со всеми видами условных операторов (if else, switch, ternary operators).
// Например:
// let answer = +prompt('Введите число от 1 до 4')
// Ответ:
// `Вы ввели число ${answer}. В переменной записалось ${result}`
// let result

// Задание 7
// Создайте переменную favDrink, присвойте ей значение в виде строки.

// • Если favDrink равно beer или vodka, нужно вывести в консоль:

// Чрезмерное употребление алкоголя вредит вашему здоровью
// • Если favDrink равно coffee, нужно вывести в консоль:

// Кофеин вреден для сердца
// • Если favDrink равно milk, нужно вывести в консоль:

// Поздравляю! Молоко очень полезное
// • Если favDrink что-то другое, нужно вывести в консоль:

// К сожалению такого напитка нет в списке
// Указания: Задание необходимо выполнить с помощью конструкции switch. Вывести всё в консоль.

`// let favDrink = prompt();

// let a = favDrink === "beer" || favDrink === "vodka";

// console.log(a);
// console.log(favDrink);

// switch (true) {
//   case true:
//     console.log("Чрезмерное употребление алкоголя вредит вашему здоровью");
//     break;
//   case "coffee":
//     console.log("Кофеин вреден для сердца");
//     break;
//   case "milk":
//     console.log("Поздравляю! Молоко очень полезное");
//     break;
//   default:
//     console.log("К сожалению такого напитка нет в списке");
// }`;

// Задание 8
// Создайте переменную stroka, присвойте ей строку или число, например:

// "987456"
// или:

// 987456
// Проверьте, что сумма первых трех цифр равняется сумме вторых трех цифр.

// Если это так, выведите в консоль:

// да
// в противном случае выведите:

// нет
// Пример: допустим в переменной stroka хранится строка "123456". Ваш код должен
//  сложить первые три числа 1 + 2 + 3, затем последние три 4 + 5 + 6

// затем, сравнить сумму, 6 === 15

// Так как сумма чисел не равна, данное выражение возвращает false.

// Получаем вывод в консоль:

// нет

// Задание 9
// создайте переменную num1 и num2, присвойте переменным числа.

// Если num1 равно или меньше 1, а num2 больше или равно 3, то выведите в консоль:

// Верно
// иначе выведите в консоль:

// Неверно

// Задание 10
// Создайте переменные firstNum и secondNum, присвойте переменным числа.

// если сумма больше 10 и в то же время меньше 20 то, умножьте сумму на 5.

// если же сумма больше 20 и меньше 50, то разделите сумму на 3.

// в любых других случаях прибавьте к сумме 10.

// Вывести результат в консоль.

// Пример, если в firstNum хранится значение 10, а в secondNum значение 5 то ваш код
//  должен в начале найти сумму - 15, так как 10 + 5 = 15

// Здесь, сумма больше десяти и меньше двадцати, ее нужно умножить на пять: 15 * 5, получаем результат:

// 75

// Задание 11
// Создайте переменные userName и password.

// Проверьте хранится ли в переменной userName значение "ivan", а в переменной password значение 333.

// Если значения верные, вывести в консоль:

// Добро пожаловать
// в противном случае:

// Пользователь не найден

// Задание 12
// Создайте переменные firstNum, secondNum, thirdNum и присвойте им числовые значения.

// Выведите в консоль число с наибольшим значением.

// Например: если в firstNum будет хранится число 5, в secondNum 3, а в thirdNum 16, то вывод
//  в консоль должен быть:

// Максимальное число 16
// Учтите возможность равенства всех трех чисел.

// Задание 13
// Создайте переменные firstNum, secondNum, age и присвойте им числовые значения.

// Если сумма firstNum и secondNum больше числа хранящегося в переменной age, то выведите в консоль:

// Сумма чисел ${sum} больше моего возраста ${age}
// К примеру: если в firstNum хранится 25, в secondNum - 10, а в age число 22, то получаем вывод в консоли:

// Сумма чисел 35 больше моего возраста 22
// Если же в firstNum хранится 25, в secondNum - 10, а в age число 37, то получаем вывод в консоли:

// Сумма чисел 35 меньше моего возраста 37

// Задание 14
// Создайте переменную num и присвойте ей числовое значение если число положительное или равно 0,
//  выведите в консоль сообщение "Положительное" если число отрицательное, выведите в консоль
//  сообщение "Отрицательное"

// Задание 15
// Создайте переменную num и присвойте ей числовое значение проверте на четность значение
//  переменной и выведите в консоль сообщение "четное" или "нечетное"

// Задание 16
// Создайте переменную variable проверьте на тип данных если значение равняется объекту то выведите консоль
// "объект является ссылочным типом данных"
// иначе выведите консоль
// "тип {тип переменной} является примитивным типом данных"

// Задание 17
// Создайте переменную num и присвойте ей числовое значение. если число равно 1
//  выведите в консоль сообщение 'осень', если равно 2 выведите "зима", если равно 3
// выведите "весна", если равно 4 выведите "лето".

// Используйте switch case.

// Задание 18
// Создайте обьект user с ключами name и age если возраст меньше 17,
// то выведите в консоль сообщение

// "Привет, меня зовут {имя} и я не совершеннолетний"
// если нет то выведите в консоль

// "Привет, меня зовут {имя} и это мой первый код"

// Задание 19
// Создайте переменную name и age. проверайте что переменная name содержит
//  строковое значение и age - числовое значение
// если все верно - выведите сообщение

// "Все введено верно"
// если какой-то тип данных не совпадает - выведите

// "Данные введены не верно"

// Задание 20
// Создайте переменную string со строкой
// если регистр маленький переведите строку в верхний регистр
// а если большой переведите в нижний
// Используйте switch case
// Не перезаписывавйте переменную string

// Задание 21
// Создайте переменную lang и присвойте ей значение en или ru или de или kg
// используя тернарный оператор выведите сообщение в зависимости от значения lang
// lang = 'en' выведет 'This is english'
// lang = 'ru' выведет 'Это русский'
// lang = 'de' выведет 'Das ist Deutsch'
// lang = 'kg' выведет 'Бул кыргыз тили'
